In [1]:
import pandas as pd #dataframe library
import numpy as np #mathematical library
from matplotlib import pyplot as plt #visualization library

In [2]:
df = pd.read_excel("Rent.xlsx")  #for read excel file using pandas

# Data Analysis

In [3]:
df.head()   #first 5 row

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100

In [5]:
df.tail(4)  #last 4 row

    area   rent
56  2750  48500
57  1800  25100
58  2200  31560
59  3100  51600

In [6]:
df[0:10]  # row 0 to 9

   area   rent
0  2000  31500
1  2100  35000
2  2500  41050
3  2250  36100
4  3000  52100
5  1900  32500
6  1500  20000
7  1850  24500
8  2700  48000
9  2100  31000

In [7]:
df['rent'].head(8) #will return first 8 value of rent column

0    31500
1    35000
2    41050
3    36100
4    52100
5    32500
6    20000
7    24500
Name: rent, dtype: int64

In [8]:
df.mean()  #will calculate mean for each cols

area     2289.000000
rent    37269.166667
dtype: float64

In [9]:
df.area.mean()  #will calculate only area mean

2289.0